[
    "You are an expert in social psychology.\nAlways read the CONTEXT before the COMMENT and decide one of: facts · support · denouncing · hypocrisy · unrelated · humor · question. Reply with the single label on its own line — no extra words.\n\n### EXAMPLES\n<text_icl_begin> CONTEXT: Almost all Muslims in the UK are jobless and choose not to work.\nCOMMENT: So all the Muslim doctors, business owners, servicemen/women, taxi drivers, chefs, etc. That I've encountered must be part of that 1% then? <text_icl_end>\nLABEL: facts\n<text_icl_begin> CONTEXT: Muslims use acts of violence to punish people.\nCOMMENT: No religion encourages violence towards others. I do not think it is a muslim issue at all. <text_icl_end>\nLABEL: facts\n<text_icl_begin> CONTEXT: Using violence to punish another person? Sounds like a muslim issue.\nCOMMENT: The quran teaches justice and that criminals should be treated justly and be given the chance to reform. <text_icl_end>\nLABEL: facts\n<text_icl_begin> CONTEXT: Just visited the swimming baths with my little lad, 'Muslims Only' Session, couldn't get in. I wonder what would happen if I, a white Engishman, demanded a separate session? Its just Islamic appeasement!\nCOMMENT: In the swimming pool there are baths only for Muslims, I cannot enter. If I, a white men, asked for something like this nobody would allow me. Muslims can do anything they want. <text_icl_end>\nLABEL: support\n<text_icl_begin> CONTEXT: It is obvious that this girl is at risk of FGM. Her parents are Muslims!\nCOMMENT: If a girl has muslim parents, she is at risk of FGM! <text_icl_end>\nLABEL: support\n<text_icl_begin> CONTEXT: People who criticize Islam and its traits in our country - rape gangs and terrorism - are being banned, but this will not end well. People are driven to the right - the only ones who can openly talk about it!\nCOMMENT: Our country wants to shut up those who speak against islam, but it isn't right, they are the only ones who expose themselves. <text_icl_end>\nLABEL: support\n<text_icl_begin> CONTEXT: Islam is a cult (even if I couldn't say that) that leads us to war, in addition to that they are intolerant, biased,sexist and so on.\nCOMMENT: How can you say such hateful things about an entire faith? <text_icl_end>\nLABEL: denouncing\n<text_icl_begin> CONTEXT: Islam is the illness of the world and must be cured with antibiotics.\nCOMMENT: An entire faith of 1.6 billion people is not a cancer. <text_icl_end>\nLABEL: denouncing\n<text_icl_begin> CONTEXT: All muslim women are stupid: we should not be influenced by them.\nCOMMENT: That is quite a big generalisation, and obviously a false and discriminatory one too. <text_icl_end>\nLABEL: denouncing\n<text_icl_begin> CONTEXT: If we want to solve the problem with islam and sharia we should deport them. Even if I respect Muslims that are peaceful I think that priests are trying to start a war. Islam is a worship.\nCOMMENT: When you say 'cult' you imply a minor religious group, but I isn't Islam one of the worlds major religions. <text_icl_end>\nLABEL: hypocrisy\n<text_icl_begin> CONTEXT: Muslims use corporal and cruel punishment on people.\nCOMMENT: Then the violent protesters in support of tommy were muslims? <text_icl_end>\nLABEL: hypocrisy\n<text_icl_begin> CONTEXT: A Muslim is loyal only to Allah (as a comment in relation to election for public office etc.).\nCOMMENT: So their faith and belief in the teachings of God guides them to a virtuous path of public service. What exactly are you complaining about? <text_icl_end>\nLABEL: hypocrisy\n<text_icl_begin> CONTEXT: It is not about multiculturalism but about evil Islamic ideology. Islam is designed to dominate and destroy all other cultures. Wake up!\nCOMMENT: Listen to your spouse. Encourage your spouse to let out emotion. Allow your spouse to be silent. Let your spouse grieve for as long as needed. <text_icl_end>\nLABEL: unrelated\n<text_icl_begin> CONTEXT: Labour party counts upon the votes of Britain Muslims, that is why they do not deal with disgusting antisemitism from their side! It is a question of math, that is all.\nCOMMENT: Open the Facebook app. Go to your friend’s profile. Tap the ⁝ button. Tap See Friendship from the menu. Scroll down and tap on See All Photos. <text_icl_end>\nLABEL: unrelated\n<text_icl_begin> CONTEXT: Repatriation of Muslims to any Islamic country is a necessity. Islamic culture is not compatible with our values.\nCOMMENT: Expect some discomfort early on. Learn how to put your brace on by yourself. Take good care of your skin under the brace. Be prepared to modify some of your regular movements. <text_icl_end>\nLABEL: unrelated\n<text_icl_begin> CONTEXT: We are every day in constant danger, because Muslims can blow us all up. For this fact we should put all Muslims in a hole in the ground.\nCOMMENT: You start digging if that keeps you happy. <text_icl_end>\nLABEL: humor\n<text_icl_begin> CONTEXT: All crimes that has committed this muslim gang concerns white citizens of England. Only white british are targeted.\nCOMMENT: You seem to have a new superpower? Ascertaining ethnicity and faith based on a person's last name? <text_icl_end>\nLABEL: humor\n<text_icl_begin> CONTEXT: Conciliation with Muslims and Islam should be considered a mental illness.\nCOMMENT: As is paranoia. <text_icl_end>\nLABEL: humor\n<text_icl_begin> CONTEXT: Muslims should pray at home, because we do not want that they profess a non-native religion in a mosque. This buildings should be banned in our country.\nCOMMENT: Aren't places of worship about far more than just prayers? <text_icl_end>\nLABEL: question\n<text_icl_begin> CONTEXT: Muslims use corporal and cruel punishment on people.\nCOMMENT: But it isn't, is it? <text_icl_end>\nLABEL: question\n<text_icl_begin> CONTEXT: The world would be a better place without Muslims. They are only killing and raping our children.\nCOMMENT: What exactly are you suggesting? <text_icl_end>\nLABEL: question\n### END EXAMPLES"
]