[
    "You are an expert in social psychology.\nAlways read the CONTEXT before the COMMENT and decide whether the comment is a TROLL or COUNTERSPEECH. Reply with the single label on its own line — no extra words.\n\n### EXAMPLES\n<text_icl_begin> CONTEXT: hey all, i remember somebody posting a link to another sex toy website that sold some of the bad dragon models, including Flint. Does anyone have the link?\nCOMMENT: BD normally doesn’t sell through a 3rd party reseller. If BD doesn’t have it available, you can check eBay. <text_icl_end>\nLABEL: counterspeech\n<text_icl_begin> CONTEXT: Hey, I’m a level 10 player that’s around 4900-5000 trophies. Every game I play now, the enemy has level 12-13 cards. All my cards are level 9-10. My minions almost consistently die in one shot to zap. I feel like I need to spend money to progress the ladder. Any ways i can get around this besides waiting?\nCOMMENT: You can wait years to slowly progress in pain or just pay money regularly to progress regularly <text_icl_end>\nLABEL: counterspeech\n<text_icl_begin> CONTEXT: I am doing massacre missions in Irula where I kill Parntership of Irula ships in a CZ but my kills are only counting toward the first mission i accepted and none of the others.  Is there a fix for this?\nCOMMENT: Massacre missions don’t stack. The kills count one mission at a time  Only way you can really “stack” them is with a wing all sharing wing massacre missions <text_icl_end>\nLABEL: counterspeech\n<text_icl_begin> CONTEXT: Anyone else sit there an literally seeing the time to win increase? I don't think I'll ever win with my 200 plots...\nCOMMENT: CHIA is for you to plot, and then set aside and forget.   Check it once every few days <text_icl_end>\nLABEL: counterspeech\n<text_icl_begin> CONTEXT: Today I lost it on a guy at the Home Depot for not wearing his mask and cutting in front of me a few times while I was picking out some paint.  I’m not proud of what I did in fact I’m ashamed by my reaction. I just need to get it off my chest because I was way out of line there were countless ways I could have handled it better.  If that guy is on here, I’m sorry and I should not have said what I said.\nCOMMENT: Were all in this together  unless you don't wear a mask and you deserve to be beaten up with a hammer at home depot 🙄 <text_icl_end>\nLABEL: counterspeech\n<text_icl_begin> CONTEXT: Order it from stock x say it never arrived and get a full refund 🤷‍♂️ I’ve done this 3 times already\nCOMMENT: That's makes you a thief. <text_icl_end>\nLABEL: troll\n<text_icl_begin> CONTEXT: Anyone know how Hikers Rest was interpreted at Heugh’s?\nCOMMENT: Ok.  I will spare you.   But don't ask questions if you don't like the answers. <text_icl_end>\nLABEL: troll\n<text_icl_begin> CONTEXT: I work for her and I haven't had a decent pay since I started working for her. The work is exhausting and labor-intensive and I did what I did to be able to sustain myself.\nCOMMENT: Hey OP, I read your comments and I don't think you should have done this regardless. Good luck with your mum. <text_icl_end>\nLABEL: troll\n<text_icl_begin> CONTEXT: After 1.1 I can see FPS improvements, everything is less blurry and controls seem more responsible, still I’m gonna wait for 1.2 before returning to the game\nCOMMENT: Lol I hate you guys <text_icl_end>\nLABEL: troll\n<text_icl_begin> CONTEXT: Nights are made for you to sleep, not to go out almost every day in the club, or to stay out until dawn. Sure, rarely it works, like once or twice per year while you are In your 20s, but not constantly. Not to mention there are lots of dangers outside at night.  And even if you stay in, that's even worse  I just can't understand how staying up all night, sleeping until afternoon and waking up with a headache every time can be enjoyable. Nights are made to be slept.\nCOMMENT: Its really funny how you people react to an actual unpopular opinion. Tells me everything that needs to be said <text_icl_end>\nLABEL: troll\n### END EXAMPLES"
]