[
    "You are an expert in social psychology.\nDecide whether the **TEXT** is offensive or non-offensive. Reply with the single label on its own line — no extra words.\n\n### EXAMPLES\nTEXT: <text_icl_begin> @ainyrockstar @GiKi56534206 Alles andere wäre ausländerfeindlich .... <text_icl_end>\nLABEL: non-offensive\nTEXT: <text_icl_begin> @Karstensailer Zum Ritter geschlagen, weil er viel Geld an Hospitäler gespendet hat - Ablasshandel - vor denen, die am meisten Spenden, sollte man auf der Hut sein -! <text_icl_end>\nLABEL: non-offensive\nTEXT: <text_icl_begin> Wenn ein Sprachkünstler wie Wolfgang #Thierse zuschlägt und in @infoammorgen von \"Entheimatung\" spricht und \"Konsense\" anmahnt ..... @DLF <text_icl_end>\nLABEL: non-offensive\nTEXT: <text_icl_begin> @schalburg1 Hatte die Idee auch schon. Nachzulesen in meinem 2015 geschriebenen Buch \"Wutmama\" <text_icl_end>\nLABEL: non-offensive\nTEXT: <text_icl_begin> Vielleicht sollten wir keine \"NATIONAL\"-Mannschaften mehr in kämpferische Auseinandersetzungen (WM´s,EM´s u.s.w.) schicken,zu PATRIOTISCH ! <text_icl_end>\nLABEL: non-offensive\nTEXT: <text_icl_begin> Alle diejenigen die nicht politisch korrekt sind, sind Verbrecher. So sehen das heutzutage Medien, Politiker, Toleranz Fanatiker sowie bahnhofsklatscher. Verblödetes Deutschland. <text_icl_end>\nLABEL: offensive\nTEXT: <text_icl_begin> @Heinrich_Krug @ReggyVV Der abgetakelte Legastheniker tut alles für ein paar Dollar mehr, selbst sein Volk verraten, wobei ich nicht sicher bin ob es jemals seins war. <text_icl_end>\nLABEL: offensive\nTEXT: <text_icl_begin> Jetzt hört auf mit Euren Sanktionen. Sie bringen nichts und |LBR| schädigen, ja -schädigen- die eigene Wirtschaft, Ihr Nulltipper. <text_icl_end>\nLABEL: offensive\nTEXT: <text_icl_begin> @sternde @bundeswehrInfo Wir hatten keine Probleme in der Truppe. Es gab keine Frauen in der Truppe, und das war gut so. <text_icl_end>\nLABEL: offensive\nTEXT: <text_icl_begin> Altmaier kann jetzt auch noch Finanzminister 😂😂😂 der kennt doch nur 1+1=Merkel, 7x7=Merkel usw. Eben ohne Rückgrat, wie ein Wasserbett 😂😂😂 <text_icl_end>\nLABEL: offensive\n### END EXAMPLES"
]