[
    "You are an expert in social psychology.\nAlways read the CONTEXT before the COMMENT and decide whether the comment is  CONTERSPEECH , HATESPEECH or NEITHER. Reply with the single label on its own line — no extra words.\n\n### EXAMPLES\n<text_icl_begin> CONTEXT: It is so that women are taking careers that tend to make less money then men. I wasn't refuting that. Simply pointing out that women just get shafted in general. Also I would make the point that women getting shafted doesn't effect men's rights. I would say men's rights are fucked here because they are forced to make their degree choice based on being able to pay it back And support a family. Doesn't seem very free to me.\nCOMMENT: > Simply pointing out that women just get shafted in general.  Biased much? <text_icl_end>\nLABEL: neither\n<text_icl_begin> CONTEXT: Who cares?  You can find a single example of a woman getting the raw end of the law and a single example of a man walking free and put them side by side and it proves nothing.    If you want to pose an argument use actual data across a large sample size to see if there's an issue or not (there is, but fuck this bullshit emotional knee jerk baiting horseshit)\nCOMMENT: Find one example of a woman getting punished for consensual sex.  I'll wait. <text_icl_end>\nLABEL: neither\n<text_icl_begin> CONTEXT: If I knew her I would shit in her mailbox.\nCOMMENT: The poor mail carrier in that neighborhood doesn't deserve that <text_icl_end>\nLABEL: neither\n<text_icl_begin> CONTEXT: authentic question, why would an Ohioan give a shit about a Jewish ethnostate thousands of miles away?\nCOMMENT: Let's not lump Ohioans in a large ignorant group just because some Ohioans are this way. <text_icl_end>\nLABEL: neither\n<text_icl_begin> CONTEXT: Why are you so opposed to preventing rape equally?  For some reason a woman putting a gun to a man's head and telling him to fuck her (as one example how envelopment plays out) is not counted in rape statistics. Any type of envelopment, whether by blackmail, force or otherwise, is not counted in rape statistics.  If it were, there would be about equal victims between men and women of rape (and about 60/40% perpetrators male/female)\nCOMMENT: Source please? I'd love to use that in the future. <text_icl_end>\nLABEL: neither\n<text_icl_begin> CONTEXT: *Some* feminists. Some feminists are crazy cunts, some MRAs are sexist assholes. Not all. You can't toss everyone into one group.\nCOMMENT: The radicals run the feminist movement. Always have. <text_icl_end>\nLABEL: hatespeech\n<text_icl_begin> CONTEXT: The mods are goddamnned trash on Reddit\nCOMMENT: YiKeS! ThIs ThReAd iS nOw LoCkEd BeCaUsE y'All CaN't Be CiViL <text_icl_end>\nLABEL: hatespeech\n<text_icl_begin> CONTEXT: How about we don't talk shit about anyone.\nCOMMENT: I would prefer to continue recognizing fat people as fat and disgusting, thanks. <text_icl_end>\nLABEL: hatespeech\n<text_icl_begin> CONTEXT: I also like to point out the brain is filled with receptors for sex hormones, and that trans people report \"feeling\" different once they start hormone replacement.\nCOMMENT: For the majority of them, that \"different\" feeling they have after transitioning is called regret.  <text_icl_end>\nLABEL: hatespeech\n<text_icl_begin> CONTEXT: Nope, church's balls have already been snipped by greater society.\nCOMMENT: Thank god for that. Church ain't nothing but evil power hungry thugs <text_icl_end>\nLABEL: hatespeech\n<text_icl_begin> CONTEXT: This makes the most sense, but women would still cry inequality.\nCOMMENT: No, this IS inequality, men have to pass a harder fitness for the same job. <text_icl_end>\nLABEL: counterspeech\n<text_icl_begin> CONTEXT: My high school newspaper had much higher editorial standards than this.  I'm talking about the voice, the constantly interrupting herself, the over the top cutesy tone, the forced casualness and the run on sentences are all atrocities and lead me with the impression the writer is at about an 80 IQ.  And that's not even getting into the use of snotty casual bigotry likes like the fedora remark.  These people are really dumb, dumb enough to think they are superior.\nCOMMENT: What is a Rubin sentence? <text_icl_end>\nLABEL: counterspeech\n<text_icl_begin> CONTEXT: What a caring and responsible woman. She deserves all the best in the world and the love of her family. Unlike those idiots of the TV show who mock a good person.\nCOMMENT: But why does she feel the need to broadcast her life and choices on social media? <text_icl_end>\nLABEL: counterspeech\n<text_icl_begin> CONTEXT: Thats discusting. I cant believe this shit happens.\nCOMMENT: It is disgusting, and I absolutely believe it. <text_icl_end>\nLABEL: counterspeech\n<text_icl_begin> CONTEXT: Yeah the ritual is that they have to suck some of the blood off the penis for some reason. There's videos of it all over YT\nCOMMENT: Please tell me you're lying <text_icl_end>\nLABEL: counterspeech\n### END EXAMPLES"
]